CakirBrs/Stm32Course/ProfPro/Src/main.c
/**
 ******************************************************************************
 * @file           : main.c
 * @author         : Auto-generated by STM32CubeIDE
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2022 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

#include <stdint.h> // ctrl+space oto tamamlama
#include "stm32f407xx.h"
#include "gpio.h"
#include "utility.h"
#include "rng.h"
#include "coreM4.h"
#include "timer.h"
/*
#if !defined(__SOFT_FP__) && defined(__ARM_FP)
  #warning "FPU is not initialized, but the project is compiling for an FPU. Please initialize the FPU before use."
#endif
*/



#define BTN_PRESSED	1
#define BTN_RELEASED 0

uint32_t g_random_number;


void EXTI0_IRQHandler(void){
	mini_delay();
	clear_pending_reg(GPIO_PIN_NO_0);
	gpio_toggleto_output_pin(GPIOD, GPIO_PIN_NO_15);
}



void task_led(){

	static enum {
		S_LED_OFF,
		S_LED_ON
	}state=S_LED_OFF;

	static clock_t t0; //duruma ilk giriş sati
	static clock_t t1; //güncel giriş saati

	t1 = clock();

	switch(state){
	case S_LED_OFF:
		if(t1>=t0+800)
		{
			gpio_writeto_output_pin(GPIOD,GPIO_PIN_NO_15,GPIO_PIN_SET);
			t0=t1;
			state=S_LED_ON;
		}
		break;
	case S_LED_ON:
		if(t1>=t0+200){
			gpio_writeto_output_pin(GPIOD, GPIO_PIN_NO_15, GPIO_PIN_RESET);
			t0=t1;
			state=S_LED_OFF;
		}
		break;
	}
}


int main(void)
{

/**
	GPIO_Handle_t Gpio_pd_blue={GPIOD,{GPIO_PIN_NO_15,GPIO_MODE_OUT,GPIO_SPEED_MEDIUM,GPIO_OTYPE_PP,GPIO_NO_PUPD}};

	gpio_init(&Gpio_pd_blue);


	//user button interrupt test
	GPIO_Handle_t user_button;
	user_button.pGpioX=GPIOA;
	user_button.gPIO_pinConfig.pin_speed= GPIO_SPEED_HIGH;
	user_button.gPIO_pinConfig.pin_number=GPIO_PIN_NO_0;
	user_button.gPIO_pinConfig.pin_mode=GPIO_MODE_FE_IT;
	user_button.gPIO_pinConfig.pin_pupd= GPIO_NO_PUPD;
	gpio_init(&user_button);
	nvic_irqno_enable(IRQ_EXTI0);
**/
	//rng_init();

	GPIO_Handle_t Gpio_pd_blue={GPIOD,{GPIO_PIN_NO_15,GPIO_MODE_OUT,GPIO_SPEED_MEDIUM,GPIO_OTYPE_PP,GPIO_NO_PUPD}};
	GPIO_Handle_t Gpio_pd_red={GPIOD,{GPIO_PIN_NO_14,GPIO_MODE_OUT,GPIO_SPEED_MEDIUM,GPIO_OTYPE_PP,GPIO_NO_PUPD}};
	GPIO_Handle_t Gpio_pd_orange={GPIOD,{GPIO_PIN_NO_13,GPIO_MODE_OUT,GPIO_SPEED_MEDIUM,GPIO_OTYPE_PP,GPIO_NO_PUPD}};
	GPIO_Handle_t Gpio_pd_green={GPIOD,{GPIO_PIN_NO_12,GPIO_MODE_OUT,GPIO_SPEED_MEDIUM,GPIO_OTYPE_PP,GPIO_NO_PUPD}};

	gpio_init(&Gpio_pd_blue);
	gpio_init(&Gpio_pd_green);
	gpio_init(&Gpio_pd_red);
	gpio_init(&Gpio_pd_orange);

	systick_config(SYSTEM_FREQ/1000); //1ms de bi systic kesme


	//lcd_init();
	//lcd_print_char('a');
	//lcd_print_string("baris");

	gpio_writeto_output_pin(GPIOD, GPIO_PIN_NO_14, GPIO_PIN_SET);
	timer_init(TIMER_6,15999,15999,0);
    while(1)
    {
    	//delay();
    	//toggle_board_random_leds();
    	task_led();
    	int a=0;
    	int b=0;
    	int n=0;
    	int m=0;
    	//timer_reset(TIMER_6);
    	timer_start(TIMER_6, TIMER_STOP);
    	m++;
    	b++;
    	n++;
    	timer_start(TIMER_6, TIMER_START);

    }
}
